In [1]:
import pandas as pd

In [3]:
employees = pd.DataFrame({
"EmpID": [1, 2, 3],
"Name": ["Alice", "Bob", "Charlie"],
"DeptID": [10, 20, 30]
})
departments = pd.DataFrame({
"DeptID": [10, 20, 40],
"DeptName": ["HR", "Engineering", "Marketing"]
})

In [11]:
pd.merge(employees,departments,on="DeptID")  # Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [15]:
pd.merge(employees, departments, on="DeptID", how="left")   # Left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [17]:
pd.merge(employees, departments, on="DeptID", how="right")    # Right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [19]:
pd.merge(employees, departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [25]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"Score":[56,78]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"age":[89,67]})
pd.concat([df1, df2])

      Name  Score   age
0    Alice   56.0   NaN
1      Bob   78.0   NaN
0  Charlie    NaN  89.0
1    David    NaN  67.0

In [27]:
pd.concat([df1,df2],axis=1)

    Name  Score     Name  age
0  Alice     56  Charlie   89
1    Bob     78    David   67

In [23]:
df1 = pd.DataFrame({"ID": [1, 2]})
df2 = pd.DataFrame({"Score": [90, 80]})
pd.concat([df1, df2], axis=1)

   ID  Score
0   1     90
1   2     80